Autodesk.Revit.DB.DGNFileFormat
Since:
2013
An enumerated type listing available Microstation versions into which a file may be exported.
Since:
2013

Autodesk.Revit.DB.DGNFileFormat.DGNVersion8
Micorstation V8 file format.

Autodesk.Revit.DB.DGNFileFormat.DGNVersion7
Micorstation V7 file format.

Autodesk.Revit.DB.DGNFileFormat.Default
The Autodesk Revit application's default file format.